# BadRailingsProfile Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..BadRailingsProfile Property
BuiltInFailures..::..SketchFailures Class See Also
---
Rail profile must have one closed loop. Wrong profile will not be shown in profiles list for rail definition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BadRailingsProfile { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BadRailingsProfile As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BadRailingsProfile {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace